using System;

namespace Task_2
{
    /*Задание 2 
    Используя Visual Studio, создайте проект по шаблону Console Application.  
    Требуется:  
    Создайте класс AbstractHandler. 
    В теле класса создать методы void Open(), void Create(), void Chenge(),
    void Save(). 
    Создать производные классы XMLHandler, TXTHandler, DOCHandler от базового 
    класса AbstractHandler. 
    Написать программу, которая будет выполнять определение документа и для 
    каждого формата должны быть методы открытия, создания, редактирования,
    сохранения определенного формата документа.  
    */
    class MainClass
    {
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
